//Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
const numStep = () => {
	for (let i = 20; i <= 30; i += 0.5){
		console.log(i);
	}
}


//Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

const dollarsToHrivna = () => {
	for (let dollars = 10; dollars <= 100; dollars += 10){
		console.log(`${dollars} долларов = ${dollars * 27} гривен`)
	}
}


//Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
const squares = (N) => {
	for (let i = 1; i <= 100; i++){
		if(i * i <= N){
			console.log(`${i * i} не превышает число ${N}`);
		}
	}
}



//Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
const integer = (N) => {
	if (N > 1) {
		for (let i = 2; i <= Math.sqrt(N); i++){
			if (N % i === 0) {
				return `${N} - не простое число`
			}
		}
		return `${N} - простое число`
	} else {
		return `${N} - не простое число`
	}
}


//Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

const cubed = (N) => {
	let num = N;
	if (N <= 0) {
		return `${num} - отрицательные числа нельзя выразить таким способом`
	}
	while (N > 1){
		if(N % 3 !== 0){
			return `${num} - число не делится на 3`
		}
		N /=3;
	}
	return `${num} - можно получить путем сведения числа 3`
}




numStep()
dollarsToHrivna()
console.log(squares(4))
console.log(integer(9))
console.log(cubed(7))